{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.2,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.2,
  "hidden_size": 768,
  "id2label": {
    "0": "bathbrush_item",
    "1": "bed",
    "2": "chair",
    "3": "comb",
    "4": "curtains",
    "5": "dinner_fork",
    "6": "dishwashing_pods",
    "7": "door",
    "8": "knife",
    "9": "ladle",
    "10": "lamp",
    "11": "lavatory_brush",
    "12": "masher",
    "13": "mat",
    "14": "mirror",
    "15": "photo_frame",
    "16": "plastic_basket",
    "17": "plastic_bottle",
    "18": "plastic_bowls",
    "19": "plastic_christmas_decorations",
    "20": "plastic_containers",
    "21": "plastic_cookware",
    "22": "plastic_cutlery_board",
    "23": "plastic_decorations",
    "24": "plastic_food_storage",
    "25": "plastic_grocery_bag",
    "26": "plastic_loofas",
    "27": "plastic_measuring_cups",
    "28": "plastic_mugs",
    "29": "plastic_packaged_cleaning_supplies",
    "30": "plastic_packaged_liquid_laundry_detergent",
    "31": "plastic_plates",
    "32": "plastic_soap_container",
    "33": "plastic_stool",
    "34": "plastic_storage_box",
    "35": "plastic_toothbrush_container",
    "36": "plastic_ziplock",
    "37": "polythene_bags",
    "38": "potted_plant",
    "39": "serving_spoon",
    "40": "single_use_plastic_baskets",
    "41": "single_use_plastic_bottle",
    "42": "single_use_plastic_bowl",
    "43": "single_use_plastic_cup",
    "44": "single_use_plastic_fork",
    "45": "single_use_plastic_knife",
    "46": "single_use_plastic_plate",
    "47": "single_use_plastic_spoon",
    "48": "soap_bottle",
    "49": "sofa",
    "50": "spatula",
    "51": "spoon",
    "52": "table",
    "53": "tongs",
    "54": "toothbrush",
    "55": "toothpaste",
    "56": "towels",
    "57": "trash_bin",
    "58": "wall_hooks_single_piece",
    "59": "wardrobe",
    "60": "water_bucket_item",
    "61": "whisk",
    "62": "window"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "bathbrush_item": 0,
    "bed": 1,
    "chair": 2,
    "comb": 3,
    "curtains": 4,
    "dinner_fork": 5,
    "dishwashing_pods": 6,
    "door": 7,
    "knife": 8,
    "ladle": 9,
    "lamp": 10,
    "lavatory_brush": 11,
    "masher": 12,
    "mat": 13,
    "mirror": 14,
    "photo_frame": 15,
    "plastic_basket": 16,
    "plastic_bottle": 17,
    "plastic_bowls": 18,
    "plastic_christmas_decorations": 19,
    "plastic_containers": 20,
    "plastic_cookware": 21,
    "plastic_cutlery_board": 22,
    "plastic_decorations": 23,
    "plastic_food_storage": 24,
    "plastic_grocery_bag": 25,
    "plastic_loofas": 26,
    "plastic_measuring_cups": 27,
    "plastic_mugs": 28,
    "plastic_packaged_cleaning_supplies": 29,
    "plastic_packaged_liquid_laundry_detergent": 30,
    "plastic_plates": 31,
    "plastic_soap_container": 32,
    "plastic_stool": 33,
    "plastic_storage_box": 34,
    "plastic_toothbrush_container": 35,
    "plastic_ziplock": 36,
    "polythene_bags": 37,
    "potted_plant": 38,
    "serving_spoon": 39,
    "single_use_plastic_baskets": 40,
    "single_use_plastic_bottle": 41,
    "single_use_plastic_bowl": 42,
    "single_use_plastic_cup": 43,
    "single_use_plastic_fork": 44,
    "single_use_plastic_knife": 45,
    "single_use_plastic_plate": 46,
    "single_use_plastic_spoon": 47,
    "soap_bottle": 48,
    "sofa": 49,
    "spatula": 50,
    "spoon": 51,
    "table": 52,
    "tongs": 53,
    "toothbrush": 54,
    "toothpaste": 55,
    "towels": 56,
    "trash_bin": 57,
    "wall_hooks_single_piece": 58,
    "wardrobe": 59,
    "water_bucket_item": 60,
    "whisk": 61,
    "window": 62
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "qkv_bias": true,
  "transformers_version": "4.57.3"
}
